<?php

return [
    'name' => 'QualityControl',
    'statics' => [
        'shifts' => [
            1 => 'از ۶ صبح تا ۶ عصر',
            2 => 'از ۶ عصر تا ۶ صبح'
        ],
        'periods' => [
            1 => 'روز کار',
            2 => 'شب کار',
        ],
        'type_periods' => [
            1 => 'A',
            2 => 'B',
            3 => 'C',
        ],
        'type_devices' => [
            1 => 'آب',
            2 => 'روغن',
        ],
        'status_devices' => [
            1 => 'مطلوب',
            2 => 'نا مطلوب',
            3 => 'نا مطلوب راست',
            4 => 'نا مطلوب چپ',
            5 => 'سطحی',
            6 => 'سطحی راست',
            7 => 'سطحی چپ',
            8 => 'خاموش ',

        ],
        '12_hours_time_work' => [
            1 => '6:30',
            2 => '7:30',
            3 => '8:30',
            4 => '9:30',
            5 => '10:30',
            6 => '11:30',
            7 => '12:30',
            8 => '1:30',
            9 => '2:30',
            10 => '3:30',
            11 => '4:30',
            12 => '5:30',
        ],
        '3_work_places' => [
            1 => 'انبار',
            2 => 'کنترل کیفیت',
            3 => 'بسته بندی',
        ],
        'status_packaging' => [
            1 => 'Ok',
            2 => 'not Ok'
        ],
        '24_hours_time_work' => [
            '12:30',
            '11:30',
            '10:30',
            '9:30',
            '8:30',
            '7:30',
            '6:30',
            '5:30',
            '4:30',
            '3:30',
            '2:30',
            '1:30',
        ],
        'status_devices_names' => [
            'مطلوب',
            'نا مطلوب',
            'نا مطلوب راست',
            'نا مطلوب چپ',
            'سطحی',
            'سطحی راست',
            'سطحی چپ',
            'خاموش ',

        ]
    ]
];
